---
kind: property
id: P:Autodesk.Revit.DB.Visual.Glazing.GlazingColorByObject
source: html/4cb2cb91-1106-eedd-b38a-a9f6d2a67917.htm
---
# Autodesk.Revit.DB.Visual.Glazing.GlazingColorByObject Property

The property labeled "Color By Object" from the "Glazing" schema.

## Syntax (C#)
```csharp
public static string GlazingColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".